УТ/src/InformationRegisters/CRM_Напоминания/CRM_Напоминания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>CRM_Напоминания</name>
  <comment>Данный регистр предназначен для реализации механизма напоминаний. Напоминание - сообщение которое может быть выведено на экран любому пользователю конфигурации единожды либо с заданной регулярностью.</comment>
  <resources>
    <name>ДатаАктуальности</name>
    <comment>Дата до которой напоминание считается актуальным. Не актуальные напоминания удаляются.</comment>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Содержание</name>
    <comment>Содержание напоминания - сообщение содержащее суть напоминания.</comment>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Важность</name>
    <comment>Важность</comment>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </resources>
  <resources>
    <name>Счетчик</name>
    <comment>Содержит число, показывающее, сколько раз напоминание было отложено</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СрокОповещения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.CRM_ПериодичностьОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОповещения</name>
    <type>
      <types>CatalogRef.CRM_ВидыОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицо</name>
    <type>
      <types>CatalogRef.КонтактныеЛицаПартнеров</types>
    </type>
  </attributes>
  <attributes>
    <name>Просмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданоПриАдресацииНаРоль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <comment>Получатель  напоминания</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Предмет</name>
    <comment>Ссылка на объект конфигурации прилагаемый к напоминанию</comment>
    <type>
      <types>CatalogRef.CRM_Диалоги</types>
      <types>ExchangePlanRef</types>
      <types>BusinessProcessRef</types>
      <types>DocumentRef</types>
      <types>ChartOfCalculationTypesRef</types>
      <types>TaskRef</types>
      <types>ChartOfCharacteristicTypesRef</types>
      <types>ChartOfAccountsRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <comment>Дата напоминания (для нового равно дате оповещения)</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОповещения</name>
    <comment>Дата напоминания +  отсрочка (срок на который пользователь отложил напоминание)  </comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Идентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ/src/CommonModules/CRM_НапоминанияКлиент/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Напоминания клиент
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Процедура для вывода активных напоминаний.
//
Процедура ВывестиАктивныеНапоминания() Экспорт
	
	ПоказыватьВЦентреОповещений = CRM_НапоминанияСервер.ПоказыватьНапоминанияВЦентреОповещений();
	МассивНапоминаний = CRM_НапоминанияСервер.ПолучитьНапоминания();
	
	Если ПоказыватьВЦентреОповещений Тогда
		
		ИдентификаторыНапоминаний = CRM_НапоминанияСервер.ПолучитьМассивИдентификаторовВыведенныхНапоминаний();
		НовыеНапоминания = Новый Массив;
		
		Для Каждого Элемент Из МассивНапоминаний Цикл
			
			Если Элемент.Просмотрено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ИдентификаторыНапоминаний.Найти(Элемент.Идентификатор) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыОткрытияФормы = Новый Структура;
			ПараметрыОткрытияФормы.Вставить("Пользователь", Элемент.Пользователь);
			ПараметрыОткрытияФормы.Вставить("Предмет", Элемент.Предмет);
			ПараметрыОткрытияФормы.Вставить("ДатаНачала", Элемент.ДатаНачала);
			ПараметрыОткрытияФормы.Вставить("ДатаОповещения", Элемент.ДатаОповещения);
			ПараметрыОткрытияФормы.Вставить("Идентификатор", Элемент.Идентификатор);
			ДействиеПриНажатии = Новый ОписаниеОповещения("ОткрытьФормуНапоминанияИзЦентраОповещений", 
				CRM_НапоминанияКлиент, ПараметрыОткрытияФормы);
			
			Важность = Элемент.Важность;
			ВажностьВысокая = 2;
			ВажностьНизкая = 0;
			Если Важность = ВажностьВысокая Тогда
				Картинка = БиблиотекаКартинок.CRM_Важно;
			ИначеЕсли Важность = ВажностьНизкая Тогда
				Картинка = БиблиотекаКартинок.CRM_ВажностьНизкая;
			Иначе 
				Картинка = Неопределено;
			КонецЕсли;
			
			Текст = Элемент.Содержание 
				+ ?(ЗначениеЗаполнено(Элемент.Партнер), НСтр("ru=' партнер: '") + Элемент.Партнер, "") 
				+ ?(ЗначениеЗаполнено(Элемент.КонтактноеЛицо), НСтр("ru=' контактное лицо: '") + Элемент.КонтактноеЛицо, "");
				
			ПоказатьОповещениеПользователя(
				Элемент.СрокИсполнения,
				ДействиеПриНажатии,
				Текст,
				Картинка,
				СтатусОповещенияПользователя.Важное,
				Элемент.КлючУникальности);
				
			НовыеНапоминания.Добавить(Элемент.Идентификатор);
			
		КонецЦикла;
		
		Если НовыеНапоминания.Количество() > 0 Тогда
			CRM_НапоминанияСервер.ДобавитьИдентификаторыВМассивВыведенныхНапоминаний(НовыеНапоминания);
		КонецЕсли;
		
	Иначе
#Если ВебКлиент Тогда
		ГлФормаНапоминанийCRM = ПолучитьФорму("ОбщаяФорма.CRM_ФормаНапоминаний", , , "Уникум");
#Иначе	
		Если ГлФормаНапоминанийCRM = Неопределено Тогда
			CRM_ЦентрМониторингаКлиент.НачатьЗамерОперацииБизнесСтатистики(
				"CRM_Статистика.Напоминания.Напоминания.ДлительностьСценариев.ВремяОткрытияФормы", Истина);
			ГлФормаНапоминанийCRM = ПолучитьФорму("ОбщаяФорма.CRM_ФормаНапоминаний", , , "Уникум");
		КонецЕсли;
#КонецЕсли
		
		Если (МассивНапоминаний.Количество() = 0) И НЕ ГлФормаНапоминанийCRM.Открыта() Тогда
			Возврат;
		КонецЕсли;
		
		СтруктураНовыхНапоминаний = Новый Структура("ПрочиеНапоминания");
		СтруктураНовыхНапоминаний.Вставить("МассивНапоминаний", МассивНапоминаний);
		
		ГлФормаНапоминанийCRM.ОбновитьТаблицуНапоминаний(СтруктураНовыхНапоминаний);
	КонецЕсли;
	
КонецПроцедуры // ВывестиАктивныеНапоминания()

// Функция формирования ключа записи по строке.
//
// Параметры:
//	Строка	- Строка	- Строка с ключом записи.
//
// Возвращаемое значение:
//	Структура	- Ключ записи
//
Функция СформироватьКлючЗаписиПоСтроке(Строка) Экспорт
	Ключ = Новый Структура();
	Ключ.Вставить("Пользователь",	Строка.Пользователь);
	Ключ.Вставить("Предмет",		Строка.Предмет);
	Если ТипЗнч(Строка.Предмет) = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты")
		 И ЗначениеЗаполнено(Строка.ВидОповещения) Тогда
		Ключ.Вставить("Содержание",		Строка.Содержание);
	Иначе	
		Ключ.Вставить("ДатаНачала",		Строка.ДатаНачала);
		Ключ.Вставить("ДатаОповещения",	Строка.ДатаОповещения);
		Ключ.Вставить("Идентификатор",	Строка.Идентификатор);
	КонецЕсли;
	Возврат Ключ;
КонецФункции // СформироватьКлючЗаписиПоСтроке()

// подключает обработчик оповещения о входящих письмах.
//
// Параметры:
//  ЗапуститьСразу	 - Булево - Запустить сразу. 
//
Процедура ПодключитьОбработчикОповещенияВходящиеПисьма(ЗапуститьСразу = Ложь) Экспорт
	
	// Получим период обновления напоминаний из настроек параметров учета.
	ВидОповещения = 
		ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.ОповещатьОНовыхВходящихПисьмах");
	ВходящиеПисьмаПериодОбновления = 
		CRM_НапоминанияСервер.ПолучитьПериодОбновленияНапоминанийВСекундах(ВидОповещения);
	
	Если ВходящиеПисьмаПериодОбновления > 0 Тогда
		
		Если ЗапуститьСразу Тогда
		
			ВывестиАктивныеНапоминанияОВходящихПисьмахСообщениях("НапоминанияОВходящихПисьмах");
		
		КонецЕсли;		
		
		ПодключитьОбработчикОжидания("CRM_ВывестиАктивныеНапоминанияОВходящихПисьмах", ВходящиеПисьмаПериодОбновления);
		
	КонецЕсли;	
	
КонецПроцедуры// ПодключитьОбработчикОжиданияВходящиеПисьма()
	
//  Подключает обработчик оповещения о входящих письмах.
//
Процедура ОтключитьОбработчикОповещенияВходящиеПисьма() Экспорт
	
	ОтключитьОбработчикОжидания("CRM_ВывестиАктивныеНапоминанияОВходящихПисьмах");
		
КонецПроцедуры// ПодключитьОбработчикОжиданияВходящиеПисьма()

// Подключает обработчик оповещения о сообщениях мессенджеров.
//
// Параметры:
//  ЗапуститьСразу	 - Булево - Запустить сразу. 
//
Процедура ПодключитьОбработчикОповещенияСообщенияМессенджеров(ЗапуститьСразу = Ложь) Экспорт
	
	// Получим период обновления напоминаний из настроек параметров учета.
	ВидОповещения = 
		ПредопределенноеЗначение("Справочник.CRM_ВидыОповещений.ОповещатьОНовыхСообщенияхМессенджеров");
	СообщенияМессенджеровПериодОбновления = 
		CRM_НапоминанияСервер.ПолучитьПериодОбновленияНапоминанийВСекундах(ВидОповещения);
	
	Если СообщенияМессенджеровПериодОбновления > 0 Тогда
		
		Если ЗапуститьСразу Тогда
		
			ВывестиАктивныеНапоминанияОВходящихПисьмахСообщениях("НапоминанияОСообщенияхМессенджеров");
		
		КонецЕсли;		
		
		ПодключитьОбработчикОжидания("CRM_ВывестиАктивныеНапоминанияОСообщенияхМессенджеров", 
			СообщенияМессенджеровПериодОбновления);
		
	КонецЕсли;	
	
КонецПроцедуры
	
// Отключает обработчик оповещения о сообщениях мессенджеров.
//
Процедура ОтключитьОбработчикОповещенияСообщенияМессенджеров() Экспорт
	
	ОтключитьОбработчикОжидания("CRM_ВывестиАктивныеНапоминанияОСообщенияхМессенджеров");
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Обработчик события "ПриНачалеРаботыСистемы".
//
// Параметры:
//	Нет.
//
Процедура ПриНачалеРаботыСистемы() Экспорт
	
	Если Не CRM_НапоминанияСервер.ИспользуютсяНапоминания() Тогда
		Возврат;
	КонецЕсли;
	
	ВывестиАктивныеНапоминания();
	
	ПериодОбновления = CRM_НапоминанияСервер.ПолучитьПериодОбновленияНапоминаний();
	ПодключитьОбработчикОжидания("CRM_ВывестиАктивныеНапоминания", ПериодОбновления);
	ПодключитьОбработчикОповещенияВходящиеПисьма(Истина);
	
	Если CRM_ОбщегоНазначенияСервер.ФункциональнаяОпция("CRM_ИспользоватьИнтеграциюСМессенджерами") Тогда
		ПодключитьОбработчикОповещенияСообщенияМессенджеров(Истина);
	КонецЕсли;
	
КонецПроцедуры

// Процедура для вывода активных напоминаний.
//
// Параметры:
//	Нет.
//
Процедура ВывестиАктивныеНапоминанияОВходящихПисьмахСообщениях(ВидОповещений) Экспорт
	
	ПоказыватьВЦентреОповещений = CRM_НапоминанияСервер.ПоказыватьНапоминанияВЦентреОповещений();
	МассивНапоминаний = CRM_НапоминанияСервер.ПолучитьНапоминания(ВидОповещений);
	
	Если ПоказыватьВЦентреОповещений Тогда
		
		ИдентификаторыНапоминаний = CRM_НапоминанияСервер.ПолучитьМассивИдентификаторовВыведенныхНапоминаний();
		НовыеНапоминания = Новый Массив;
		
		Для Каждого Элемент Из МассивНапоминаний Цикл
			
			Если Элемент.Просмотрено Тогда
				Продолжить;
			КонецЕсли;
			
			Если ИдентификаторыНапоминаний.Найти(Элемент.Идентификатор) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ПараметрыОткрытияФормы = Новый Структура;
			ПараметрыОткрытияФормы.Вставить("Пользователь", Элемент.Пользователь);
			ПараметрыОткрытияФормы.Вставить("Предмет", Элемент.Предмет);
			ПараметрыОткрытияФормы.Вставить("ДатаНачала", Элемент.ДатаНачала);
			ПараметрыОткрытияФормы.Вставить("ДатаОповещения", Элемент.ДатаОповещения);
			ПараметрыОткрытияФормы.Вставить("Идентификатор", Элемент.Идентификатор);
			ДействиеПриНажатии = Новый ОписаниеОповещения("ОткрытьФормуНапоминанияИзЦентраОповещений", 
				CRM_НапоминанияКлиент, ПараметрыОткрытияФормы);
			
			Важность = Элемент.Важность;
			ВажностьВысокая = 2;
			ВажностьНизкая = 0;
			Если Важность = ВажностьВысокая Тогда
				Картинка = БиблиотекаКартинок.CRM_Важно;
			ИначеЕсли Важность = ВажностьНизкая Тогда
				Картинка = БиблиотекаКартинок.CRM_ВажностьНизкая;
			Иначе 
				Картинка = Неопределено;
			КонецЕсли;
			
			Текст = Элемент.Содержание;
			Если Элемент.Свойство("Партнер") И Элемент.Свойство("КонтактноеЛицо") Тогда
				Текст = Текст 
					+ ?(ЗначениеЗаполнено(Элемент.Партнер), НСтр("ru=' партнер: '") + Элемент.Партнер, "") 
					+ ?(ЗначениеЗаполнено(Элемент.КонтактноеЛицо), НСтр("ru=' контактное лицо: '") + Элемент.КонтактноеЛицо, "");
			КонецЕсли;
				
			ПоказатьОповещениеПользователя(
				Элемент.СрокИсполнения,
				ДействиеПриНажатии,
				Текст,
				Картинка,
				СтатусОповещенияПользователя.Важное,
				Элемент.КлючУникальности);
				
			НовыеНапоминания.Добавить(Элемент.Идентификатор);
			
		КонецЦикла;
		
		Если НовыеНапоминания.Количество() > 0 Тогда
			CRM_НапоминанияСервер.ДобавитьИдентификаторыВМассивВыведенныхНапоминаний(НовыеНапоминания);
		КонецЕсли;
		
	Иначе
		
	#Если ВебКлиент Тогда
		ГлФормаНапоминанийCRM = ПолучитьФорму("ОбщаяФорма.CRM_ФормаНапоминаний", , , "Уникум");
	#Иначе	
		Если ГлФормаНапоминанийCRM = Неопределено Тогда
			CRM_ЦентрМониторингаКлиент.НачатьЗамерОперацииБизнесСтатистики(
				"CRM_Статистика.Напоминания.Напоминания.ДлительностьСценариев.ВремяОткрытияФормы", Истина);
			ГлФормаНапоминанийCRM = ПолучитьФорму("ОбщаяФорма.CRM_ФормаНапоминаний", , , "Уникум");
		КонецЕсли;
	#КонецЕсли	
		Если (МассивНапоминаний.Количество() = 0) И НЕ ГлФормаНапоминанийCRM.Открыта() Тогда
			Возврат;
		КонецЕсли;
		СтруктураНовыхНапоминаний = Новый Структура(ВидОповещений);
		СтруктураНовыхНапоминаний.Вставить("МассивНапоминаний", МассивНапоминаний);
		ГлФормаНапоминанийCRM.ОбновитьТаблицуНапоминаний(СтруктураНовыхНапоминаний);
		
	КонецЕсли;
	
КонецПроцедуры // ВывестиАктивныеНапоминания()

#Область ОбработчикиКоманд

Процедура ОткрытьФормуНапоминания(ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Содержание", ПараметрКоманды);
	ПараметрыФормы.Вставить("Предмет", ПараметрКоманды);
	ОткрытьФорму("РегистрСведений.CRM_Напоминания.ФормаЗаписи", ПараметрыФормы,
		 ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность,
		 ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры// ОткрытьФормуНапоминаний() Экспорт

Процедура ОткрытьФормуНапоминанияИзЦентраОповещений(ДанныеЗаписи) Экспорт
	
	CRM_НапоминанияСервер.ИзменитьПризнакПросмотра(ДанныеЗаписи, Истина);
	
	Если ТипЗнч(ДанныеЗаписи.Предмет) = Тип("СправочникСсылка.CRM_УчетныеЗаписиМессенджеров") Тогда
		ОткрытьФорму("Обработка.CRM_Мессенджер.Форма.ФормаМессенджера");
	ИначеЕсли ТипЗнч(ДанныеЗаписи.Предмет) = Тип("СправочникСсылка.УчетныеЗаписиЭлектроннойПочты") Тогда
		ОткрытьМенеджерПочты(ДанныеЗаписи.Предмет);
	Иначе
		ПараметрыСоздания = Новый Массив;
		ПараметрыСоздания.Добавить(ДанныеЗаписи);
		КлючЗаписи = Новый(Тип("РегистрСведенийКлючЗаписи.CRM_Напоминания"), ПараметрыСоздания);
		ПараметрыОткрытия = Новый Структура("Ключ", КлючЗаписи);
		Попытка
			ОткрытьФорму("РегистрСведений.CRM_Напоминания.ФормаЗаписи", ПараметрыОткрытия);
		Исключение
			ПоказатьПредупреждение(, НСтр("ru = 'Данное оповещение больше не актуально.'"), 120);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьФормуНапоминанияИзПодключаемойКоманды(Ссылка, Параметры) Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Содержание", Ссылка);
	ПараметрыФормы.Вставить("Предмет", Ссылка);
	ОткрытьФорму("РегистрСведений.CRM_Напоминания.ФормаЗаписи", ПараметрыФормы,
		Параметры.Форма);
	
КонецПроцедуры

Процедура ОткрытьМенеджерПочты(УчетнаяЗапись)
	
	ФормаПочтовогоМенеджера = ПолучитьФорму("Обработка.CRM_МенеджерПочты.Форма");
	Если ФормаПочтовогоМенеджера = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ФормаПочтовогоМенеджера.Открыта() Тогда
		ФормаПочтовогоМенеджера.УстановитьПапкуУчетнойЗаписи(УчетнаяЗапись, "Входящие");
		ФормаПочтовогоМенеджера.Активизировать();
	Иначе
		ФормаПочтовогоМенеджера.УчетнаяЗаписьВыбранная	= УчетнаяЗапись;
		ФормаПочтовогоМенеджера.ВидПапкиВыбранный		= "Входящие";
		ФормаПочтовогоМенеджера.Открыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецОбласти
